000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/КомментарийПоСтрокам/КомментарийПоСтрокам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КомментарийПоСтрокам</name>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Просмотрен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ЗапросДоступностиТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючСвязи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/КомментарийПоСтрокам/ManagerModule.bsl
Процедура ЗаписьКомментария(СтруктураКомментария) Экспорт
	
	НаборЗаписей = РегистрыСведений.КомментарийПоСтрокам.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Автор.Установить(СтруктураКомментария.Автор);
	НаборЗаписей.Отбор.Документ.Установить(СтруктураКомментария.Документ);
	НаборЗаписей.Отбор.Дата.Установить(СтруктураКомментария.Дата);
	НаборЗаписей.Отбор.КлючСвязи.Установить(СтруктураКомментария.КлючСвязи);

	НоваяЗапись = НаборЗаписей.Добавить();

	НоваяЗапись.Дата = СтруктураКомментария.Дата;
	НоваяЗапись.Документ = СтруктураКомментария.Документ;
	НоваяЗапись.Автор = СтруктураКомментария.Автор;
	НоваяЗапись.КлючСвязи = СтруктураКомментария.КлючСвязи;
	НоваяЗапись.Комментарий = СтруктураКомментария.Комментарий;
	НоваяЗапись.Просмотрен = СтруктураКомментария.Просмотрен;
	Если СтруктураКомментария.УзелСоздания = Неопределено Тогда
		НоваяЗапись.УзелСоздания = ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().ЭлементСтруктуры;
	Иначе
		НоваяЗапись.УзелСоздания = СтруктураКомментария.УзелСоздания;
	КонецЕсли;

	НаборЗаписей.Записать(Истина); 
	
КонецПроцедуры

Функция СтруктураКомментария() Экспорт 
	
	СтруктураКомментария = Новый Структура;
	СтруктураКомментария.Вставить("Дата");
	СтруктураКомментария.Вставить("Документ");
	СтруктураКомментария.Вставить("Автор");
	СтруктураКомментария.Вставить("КлючСвязи");
	СтруктураКомментария.Вставить("Комментарий");
	СтруктураКомментария.Вставить("Просмотрен");
	СтруктураКомментария.Вставить("УзелСоздания", Неопределено);
	
	Возврат СтруктураКомментария;

КонецФункции
